In [15]:
# DataFrame
import pandas as pd

name = ['Rahul', 'Pavan', 'Queen', 'King', 'Ravi']
area = ['Pune', 'Delhi', 'Bangalore', 'Noida', 'Punewest']
Math = [34,67,89,100,45]
English = [66,88,99,77,34]
Science = [77,88,45,90,23]

Details = {
    'Name':name, 
    "Area":area, 
    "Math":Math, 
    "English":English,
    "Science":Science
}
data = pd.DataFrame(Details)
print(data)

    Name       Area  Math  English  Science
0  Rahul       Pune    34       66       77
1  Pavan      Delhi    67       88       88
2  Queen  Bangalore    89       99       45
3   King      Noida   100       77       90
4   Ravi   Punewest    45       34       23

In [18]:
data.loc[0]

Name       Rahul
Area        Pune
Math          34
English       66
Science       77
Name: 0, dtype: object

In [19]:
data.loc[0,["Science"]]

Science    77
Name: 0, dtype: object

In [21]:
data.loc[2:3]

    Name       Area  Math  English  Science
2  Queen  Bangalore    89       99       45
3   King      Noida   100       77       90

In [24]:
data.loc[2:3,["Science"]]

   Science
2       45
3       90

In [25]:
data.loc[2:3,["Name","Science"]]

    Name  Science
2  Queen       45
3   King       90

In [27]:
data.loc[2:3,"Math":"Science"]

   Math  English  Science
2    89       99       45
3   100       77       90